jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
#include "stm32f4xx.h"
#include "uart5.h"
#include "network_handle.h"
#include "printer.h"
#include "delay.h"
#include "rtc.h"
#include "stdio.h"
#include "string.h"
#include "MsgHandle.h"
#include "sd.h"
#include "uart6.h"
#include "serialscreen.h"

static long Batch = 0x00 ;//交易流水号
__attribute__ ((aligned (4)))
unsigned char  TID[7] = {0xa2,0x00,0x04,0x10,0x00,0x00,0x39}; /*终端TID码：可修改*/
unsigned char  BRWN[7+3] = {0xa6,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0x00,0x00};	 /*交易流水线*/
unsigned char  BNO[6] = {0xa7,0x00,0x03,0x00,0x00,0x00};               /*批次号：可修改*/
unsigned char  DeviceArea[3+3]={0xac,0x00,0x03,0x17,0x03,0x02};         /*终端所在区域编号：可修改*/
unsigned char  DeviceAreaNO[4+3]={0xad,0x00,0x04,0x17,0x03,0x02,0x07};   /*终端所在地域编号：可修改*/
unsigned char  DeviceStatus[2+3]={0xae,0x00,0x02,0xE0,0x10};	   /*终端状态*/
unsigned char  ErroDelect[2+3]={0xae,0x00,0x02,0xE0,0x10};	   /*加入数组，防止数据指针超出界限错误炒作*/
unsigned char  DealData[7]={0xa9,0x00,0x04,0x00,0x00,0x00,0x00};     /*交易日期*/
unsigned char  DealTime[6]={0xaa,0x00,0x03,0x00,0x00,0x00};       /*交易时间*/
unsigned char  MAC[8+3]={0xc9,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};   /*MAC*/
unsigned char  DealBalance[6+3]={0xb0,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};    /*交易金额*/
unsigned char  MealID[4+3] = {0xb1,0x00,0x04,0x10,0x00,0x00,0x20} ;                /*餐品ID  10000020*/
unsigned char  MealNO[1+3] = {0xb2,0x00,0x01,0x00};		   /*餐品购买数量*/
unsigned char  MealName[20+3] ={0xb3,0x00,0x14,'a','b','c','d','e','a','b','c','d','e','a','b','c','d','e','a','b','c','d','a'};  /*餐品名字*/
unsigned char  MealPrice[6+3]={0xbd,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};	  /*餐品价格*/
unsigned char  PayType[1+3]={0xbf,0x00,0x01,0x00};        /*支付方式*/
unsigned char  Change[6+3]={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00} ;        /*找零金额*/
unsigned char  RemainMealNum[2+3]={0xd8,0x00,0x02,0x00,0x00};  /*剩余餐品数量*/
unsigned char  MName[20+3]={0xa4,0x00,0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};             /*商户号MID*/
unsigned char  APPVersion[8+3]={ 0xc2,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};       /*应用程序版本*/
unsigned char  ParaFileVersion[8+3]={0xc3,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};   /*参数文件版本*/
unsigned char  BDataFileVersion[8+3]={0xc4,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};	/*业务数据文件版本*/
unsigned char  ChechStatus[2+3]={0xab,0x00,0x02,0x00,0x00};                                     /*自检状态*/
unsigned char  MID[3+3]={ 0xa3,0x00,0x03,0x10,0x00,0x01};                                       /*商户号MID*/
unsigned char  TTCount[3+2]     ={0xb7,0x00,0x02,0x00,0x00};	                                  /*交易总笔数 */
unsigned char  TNCT[6+3]        ={0xb8,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};                /*交易总金额*/
unsigned char  TNtype[3+2]      ={0xd9,0x00,0x02,0x00,0x00};											        /*交易总产品数 d9*/
unsigned char  TotalChange[3+6] ={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};					/*总找零金额 d7*/
unsigned char  TakeMealFlag[3+2]={0xdb,0x00,0x02,0x00,0x00};                              /*取餐标志 0x01:成功 0x02:失败 */
unsigned char  PosDevNum[10+3]=   {0xe0,0x00,0x0a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};                  /*刷卡器终端号*/
unsigned char  PosTenantNum[15+3]={0xe1,0x00,0x0f,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}; /*刷卡器商户号*/
unsigned char  PosBatchNum[10+3]= {0xe2,0x00,0x0a,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};      /*交易流水号*/
unsigned char  PosUserNum[21+3]=  {0xe3,0x00,0x15,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};  /*用户银行卡号*/
unsigned char  UpdataFlag[3+1]=  {0xc1,0x00,0x01,0x00};                                     //更新标识
unsigned char  MenuNo[3+1]= {0xdd,0x00,0x01,0x01};                                        /*菜单编号,0x01,0x02,0x03,0x04,0x05（初步）*/
unsigned char  ACK[3+1]={0xc0,0x00,0x02,0x00};                                            //应答码
unsigned char  WordKeyCipher[11]={0xc7,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};//工作密钥
__attribute__ ((aligned (1)))
/*与后台进行数据交换的结构体：可修改*/
const Meal_struction Meal[MealKindTotoal]={
						    /*餐品数量*/	 /*餐品ID*/ 			     /*餐品名字*/				    /*餐品价格*/			     /*餐品类型*/
								   0x00,0x00,	 0x10,0x00,0x00,0x41,  {"秘制猪手饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x42,  {"卤香鸡腿饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x43,  {"红萝卜木耳炒肉饭"},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x44,  {"黑椒猪扒饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x45,  {"蒲烧鲷鱼饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
								   0x00,0x00,	 0x10,0x00,0x00,0x46,  {"蒲烧秋刀鱼饭    "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},  
                   0x00,0x00,	 0x10,0x00,0x00,0x47,  {"咖喱鸡饭        "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x48,  {"梅菜扣肉饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x49,  {"盐焗鸡翅饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x50,  {"豆汁排骨饭      "},   0x00,0x00,0x00,0x00,0x15,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x51,  {"红烧排骨套餐    "},   0x00,0x00,0x00,0x00,0x40,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x52,  {"红焖牛肉饭      "},   0x00,0x00,0x00,0x00,0x10,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x53,  {"土豆焖鸡饭      "},   0x00,0x00,0x00,0x00,0x10,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x54,  {"香辣排骨饭      "},   0x00,0x00,0x00,0x00,0x10,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x55,  {"五香卤水鸭套餐  "},   0x00,0x00,0x00,0x00,0x40,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x56,  {"辣子鸡套餐      "},   0x00,0x00,0x00,0x00,0x40,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x57,  {"糖醋龙利鱼饭    "},   0x00,0x00,0x00,0x00,0x40,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x58,  {"干豆角烧肉饭    "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x59,  {"豆汁鸡块饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x60,  {"飘香肉饼饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x61,  {"鱼香肉丝饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x62,  {"糖醋龙力鱼饭    "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x63,  {"萝卜排骨饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x64,  {"红烧鸭块饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x65,  {"香菇滑鸡饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x66,  {"红烧牛腩饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x67,  {"土豆烧肉饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x68,  {"卤香鸡腿饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},
                   0x00,0x00,	 0x10,0x00,0x00,0x69,  {"红烧大排饭      "},   0x00,0x00,0x00,0x00,0x12,0x00, 	{"C001"},     
						   };
unsigned char	Record_buffer[254] = {0} ;

const uint8_t  DeviceTemperature[2+3]={0xdc,0x00,0x02,0x00,0x00};	   /*设备温度，最后的一个字节为温度*/
const uint8_t  DeviceCoinsTotal[2+3] ={0xde,0x00,0x02,0x00,0x00};	   /*机内硬币数，后两个字节存储的是机内*/
const uint8_t  Discount =10;  //定义折扣10折(不打折),5折(半价),0折(不要钱)

