jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
const char price_1st = 15*Discount/10; 
const char price_2nd = 15*Discount/10;
const char price_3rd = 15*Discount/10;
const char price_4th = 15*Discount/10;
const char price_5th = 15*Discount/10;
const char price_6th = 15*Discount/10;
const char price_7th = 15*Discount/10;
const char price_8th = 15*Discount/10;
const char price_9th = 15*Discount/10;
const char price_10th= 15*Discount/10;
const char price_11th= 40*Discount/10;
const char price_12th= 10*Discount/10;
const char price_13th= 10*Discount/10;
const char price_14th= 10*Discount/10;
const char price_15th= 40*Discount/10;
const char price_16th= 40*Discount/10;
const char price_17th= 40*Discount/10;
const char price_18th= 12*Discount/10;
const char price_19th= 12*Discount/10;
const char price_20th= 12*Discount/10;
const char price_21th= 12*Discount/10;
const char price_22th= 12*Discount/10;
const char price_23th= 12*Discount/10;
const char price_24th= 12*Discount/10;
const char price_25th= 12*Discount/10;
const char price_26th= 12*Discount/10;
const char price_27th= 12*Discount/10;
const char price_28th= 12*Discount/10;
const char price_29th= 12*Discount/10;
/*屏幕显示的餐品名称*/
const char    mealname_1st[12] = {"秘制猪手饭"}; 
const char    mealname_2nd[12] = {"卤香鸡腿饭"};
const char    mealname_3rd[18] = {"红萝卜木耳炒肉饭"};
const char    mealname_4th[12] = {"黑椒猪扒饭"};
const char    mealname_5th[12] = {"蒲烧鲷鱼饭"};
const char    mealname_6th[14] = {"蒲烧秋刀鱼饭"};
const char    mealname_7th[10] = {"咖喱鸡饭"};
const char    mealname_8th[12] = {"梅菜扣肉饭"};
const char    mealname_9th[12] = {"盐焗鸡翅饭"};
const char    mealname_10th[12]= {"鼓汁排骨饭"};
const char    mealname_11th[14]= {"红烧排骨套餐"};
const char    mealname_12th[12]= {"红焖牛肉饭"};
const char    mealname_13th[12]= {"土豆焖鸡饭"};
const char    mealname_14th[12]= {"香辣排骨饭"};
const char    mealname_15th[16]= {"五香卤水鸭套餐"};
const char    mealname_16th[12]= {"辣子鸡套餐"};
const char    mealname_17th[14]= {"糖醋龙利鱼饭"};
const char    mealname_18th[14]= {"干豆角烧肉饭"};
const char    mealname_19th[12]= {"豆汁鸡块饭"};
const char    mealname_20th[12]= {"飘香肉饼饭"};
const char    mealname_21th[12]= {"鱼香肉丝饭"};
const char    mealname_22th[14]= {"糖醋龙力鱼饭"};
const char    mealname_23th[12]= {"萝卜排骨饭"};
const char    mealname_24th[12]= {"红烧鸭块饭"};
const char    mealname_25th[12]= {"香菇滑鸡饭"};
const char    mealname_26th[12]= {"红烧牛腩饭"};
const char    mealname_27th[12]= {"土豆烧肉饭"};
const char    mealname_28th[12]= {"酱卤鸡腿饭"};
const char    mealname_29th[12]= {"红烧大排饭"};
uint8_t Menu_interface= 0x00;
uint8_t MealSet_interface= 0x00;
uint8_t sell_type[4]={0};//存储四个菜品的的ID,在签到的时候需要获取的有当前需要显示售卖的哪一个界面和那几个餐品
/*与后台对应，套餐结构体装套餐所存的餐品ID，四个*/
const uint8_t sell_type_1st[4]={0x01,0x02,0x03,0x05}; //第一个售餐菜单
const uint8_t sell_type_2nd[4]={0x03,0x05,0x07,0x08}; //第二个售餐菜单
const uint8_t sell_type_3rd[4]={0x0D,0x02,0x05,0x08}; //第三个售餐菜单
const uint8_t sell_type_4th[4]={0x09,0x0A,0x05,0x08}; //第四个售餐菜单
const uint8_t sell_type_5th[4]={0x0E,0x0C,0x0D,0x02}; //第五个售餐菜单
const uint8_t sell_type_6th[4]={0x0F,0x0B,0x10,0x11}; //第六个售餐菜单
const uint8_t sell_type_7th[4]={0x17,0x19,0x18,0x16}; //第七个售餐菜单
const uint8_t sell_type_8th[4]={0x12,0x13,0x14,0x15}; //第八个售餐菜单
const uint8_t sell_type_9th[4]={0x1A,0x1B,0x1C,0x1D}; //第九个套餐菜单
 /*******************************************************************************
* Function Name  : GetBRWN
* Description    : 功能: 得到流水号
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
void GetBRWN(void)
{
   /*时间作为流水号*/
  RTC_TimeShow();
	BRWN[3] =    20 /10 *16 + 20%10 ;	        /*年*/
	BRWN[4] =    TimeDate.Year /10 *16 +  TimeDate.Year%10 ;
	BRWN[5] =    TimeDate.Month /10 *16 + TimeDate.Month%10 ;
	BRWN[6] =    TimeDate.Date /10 *16 +  TimeDate.Date%10 ;
	BRWN[7] =    TimeDate.Hours /10 *16 + TimeDate.Hours%10 ;
	BRWN[8] =    TimeDate.Minutes /10 *16 + TimeDate.Minutes%10 ;
	BRWN[9] =    TimeDate.Senconds /10 *16 + TimeDate.Senconds%10 ;
}

/*******************************************************************************
* Function Name  : GetCrc16
* Description    : 进行CRC校验
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
unsigned int GetCrc16(unsigned char *bufData,unsigned int sizeData)
{
  unsigned int Crc ,i = 0;
	unsigned char j = 0;
	if(sizeData == 0)
	  return 1 ;
	Crc = 0 ;
	for(i=0;i<sizeData;i++)
	{
	  Crc ^= bufData[i];
	  for(j=0;j<8;j++)
	  {
	    if(Crc&0x0001)
		  {
		    Crc >>=1 ;
		    Crc ^=0x08408 ;
		  }
		  else
		    Crc >>=1 ;
	  }
	}
	return Crc ;
}

/*---------------------------------------------------------------------------
void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf);
功能: 将一个 16bit 的整数转换成 Buffer 数据, 高位在前
高位在前
*/
void HL_IntToBuffer(const uint16_t int_v, unsigned char *ret_buf)
{
    ret_buf[0] = (unsigned char)(int_v >> 8);  // [0] 对应 --> 高位
    ret_buf[1] = (unsigned char)(int_v & 0xff);

}
/*---------------------------------------------------------------------------
 uint16_t HL_BufferToInt(const unsigned char *in_buf);
 功能: 将缓冲区数据转换成整数, 高位在前
 高位在前
*/
uint16_t HL_BufferToInit(const unsigned char *in_buf)
{
    uint16_t ret_n;
    ret_n = in_buf[0];           // 取高位
    ret_n = (ret_n << 8);
    ret_n += in_buf[1];          // 取低位
    return ret_n;
}

/*---------------------------------------------------------------------------
uint32_t HL_BufferToLong(const unsigned char *in_buf);
功能: 将 (unsigned char *) 数据转换成 Long 型, 高位在前
高位在前
*/
uint32_t HL_BufferToLong00(const unsigned char *in_buf)
{
    uint32_t ret_n;

    ret_n = in_buf[0];     // 最高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[1];    // 次高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[2];    // 高位
    ret_n = (ret_n << 8);

    ret_n += in_buf[3];    // 低位

    return ret_n;
}

/*---------------------------------------------------------------------------
void LH_LongToBuffer(uint32_t in_n, unsigned char *ret_buf);
功能: 将长整数转换成 unsigned char 型数据, 高位在前
*/
void HL_LongToBuffer00(const uint32_t in_n, unsigned char *ret_buf)
{
    ret_buf[0] = (unsigned char)((in_n >> 24) & 0xff);   // [0] 对应 --> 高位
    ret_buf[1] = (unsigned char)((in_n >> 16) & 0xff);
    ret_buf[2] = (unsigned char)((in_n >> 8) & 0xff);
    ret_buf[3] = (unsigned char)(in_n & 0xff);
}
 //---------------------------------------------------------------------------
// 功能: 将缓冲区清零
/*******************************************************************************
* Function Name  : mem_set_00
* Description    : 功能: 将缓冲区清零
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
static void mem_set_00(unsigned char *dest, const long s_len)
{
    long j0;

    for(j0 = 0; j0 < s_len; j0++)  dest[j0] = 0;
}


//---------------------------------------------------------------------------
// 功能: 字符串拷贝
/*******************************************************************************
* Function Name  : mem_set_00
* Description    : 功能: 将缓冲区清零
* Input          : CRC
* Output         : 数组以及大小
* Return         : CRC
*******************************************************************************/
uint16_t mem_copy01(unsigned char *dest, const unsigned char *source, const long s_len)
{
  long j0;
  for(j0 = 0; j0 < s_len; j0++)  dest[j0] = source[j0];
  dest[j0++]=',';
  return (s_len+1);
}
uint16_t mem_copy00(unsigned char *dest, const unsigned char *source, const long s_len)
{
  long j0;
  for(j0 = 0; j0 < s_len; j0++)  dest[j0] = source[j0];
  return (s_len);
}

/*********************/
typedef struct
{
  unsigned char  Lenght[2] ;
  unsigned char  MealNO[35*4];    /*餐品具体数目*/

}ReturnData_Struction;
ReturnData_Struction  ReturnData;

