jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
  /*******************************************************************************
* Function Name  : CheckResponseCode
* Description    : 检查返回码看什么错误
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char CheckResponseCode(unsigned char Cmd)
{
// unsigned char  i = 0 ;
  switch(Cmd)
  {
		case 0x00 : /*交易成功*/
			return 0 ;
		case 0x01 : /*包CRC错误*/
			return 1 ;
		case 0x02 : /*包CRC错误*/
				break;
		case 0x03 : /*无效的终端类型*/
				break  ;
		case 0x04 : /*协议版本错误*/
				break ;
		case 0x05 : /*无效的终端SN*/
				break;
		case 0x06 : /*无效的商户号(MID)*/
				break;
		case 0x07 :	/*无效文件偏移地址*/
				break ;
		case 0x08 : /*无效文件偏移地址*/
				break ;
		case 0x09 : /*其他包内容错误*/
				break;
		case 10 :	/*商户号与设备号对应关系错误*/
				break ;
		case 11 : /*餐品数据对比不一致*/
					 {
					 }
				break ;
		case 12 : /*后台不存在设备区域ID、所在点ID信息*/
				break;
		case 13 : /*设备上送的区域ID、所在点ID信息与后台不匹配*/
				break ;
		case 14 : /*设备上送餐品信息格式不正确*/
				break ;
		case 15 :  /*取餐交易（批次号、流水号）重复*/
				break;
		case 16 : /*终端上送的餐品数据里某餐品信息不存在于后台数据库*/
				break;
		case 17 : /*批上送日志格式不正确*/
				break;
		case 20 :  /*无效金额*/
				break;
		case 21 : /*原始金额错误*/
				break;
		case 22 : /*无效餐品ID号*/
				break;
		case 23 : /*购买数量无效*/
				break ;
		case 0x24 : Batch ++ ;
				break;
		case 30: /*密码错*/
				 break ;
		case 31 : /*账户内余额不足*/
				 break;
		case 40 : /*锁定终端*/
				 break;
		case 41 : /*解锁终端*/
				 break ;
		case 50 : /*后台文件版本不存在*/
				 break;
		case 51 :/*请求文件版本与后台发布的文件版本不一致*/
					break ;
		case 96 : /*后台系统错误*/
					break ;
		default :break;
  }
	return 3; /*后来加的防止有waring*/
}
 /*******************************************************************************
* Function Name  : GetData
* Description    : 得到相应命令的数据
* Input          : unsigned char *dest,unsigned char *souce,const long s_len,unsigned char Cmd
* Output         : void
* Return         : void
*******************************************************************************/
long  GetData(unsigned char *dest,unsigned char *souce, long s_len,unsigned char Cmd)
{
	long i = 0 ,j=0,Cmdlenght=0;
	for(i=0;i<s_len;i++)
	{
	  if(souce[i] == Cmd)	 /*得到命令*/
	  {
		  Cmdlenght= HL_BufferToInit(&souce[i+1]);    /*得到数据长度*/
//		printf("Cmdlenght=%d\r\n",Cmdlenght);
		  for(j=0;j<Cmdlenght;j++)				      /*得到数据  */
		  {
			  dest[j] = souce[i+j+3] ;
//			printf("dest[%d]=%x\r\n",j,dest[j]);
		  }
		  return Cmdlenght  ;
		}
	}
	return 0 ;
}
 /*******************************************************************************
* Function Name  : CmdDataSend
* Description    : 发送数据函数
* Input          : unsigned char *p  long Lenght
* Output         : void
* Return         : void       ok
*******************************************************************************/
static void CmdDataSend(unsigned char *p,long Lenght)
{
  uint16_t i=0;
	 /*初始化*/
 	F_RX1_SYNC = 0;
	rx1BufIndex = 0;
	F_RX1_VAILD = 1;
	CrcValue = 0;
	F_RX1_Right = 0 ;
	for(i=0;i<Lenght;i++)
	{
	  UART5->DR = (u8) p[i];
    while((UART5->SR&0X40)==0);//循环发送,直到发送完毕
	  //delay_ms(5);
	  //printf(" p[%d]=%x\r\n", i,p[i]);
	}
}

unsigned char  MealComparefunDemo(long Cmd ,unsigned char *p,unsigned long lenght)
{
  uint16_t  CRCValue= 0 ;
// static  int Bno = 0 ;
  unsigned char Waittimeout = 250 ;
  /*给数组赋值命令*/
  HL_IntToBuffer(Cmd,&p[1]);
  /*数组长度*/
  HL_IntToBuffer(lenght-8,&p[3]);
  /*得到数据的CRC*/
  CRCValue=GetCrc16(&p[1],lenght-4);
  /*把CRC赋值到数组中*/
  HL_IntToBuffer(CRCValue,&p[lenght-2]);
  /*发送命令*/
  CmdDataSend(p,lenght);	//发送数据
  /*等待数据返回*/
  while(--Waittimeout)
	{
		delay_ms(10);
		if(F_RX1_Right) //接收到有限数据CRC正确
		{
		  F_RX1_Right = 0 ;
		  break;
		}
  }
  if(Waittimeout == 0 )
		return 1 ;//超时返回1
  return 0 ;
}


/*******************************************************************************
发送签到后，返回给终端的结构体数据
*******************************************************************************/
/*******************************************************************************
* Function Name  : 签到 	 0X0100
* Description	 :签到
* Input 		 : void
* Output		 : void
* Return		 : char
* Time	       :2014-4-7  MrLao  ok
*******************************************************************************/

unsigned char  SignInFun(void)
{
	unsigned char i = 0 ;
	 long  Command = 0x0100 ;
	 long  Lenght = 0,j = 0  ;
	 long  CmdLenght = 0 ;  //命令长度
	 unsigned char  Send_Buf[400]={0};
	 mem_set_00(rx1Buf,sizeof(rx1Buf));	 //数据清零

	/* 命令包 ++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));      /*终端的TID*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MID,sizeof(MID));  /*商户号TID 命令(1)+数据长度(2)+数据     100001*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MName,sizeof(MName));  /*商户名称*/
	GetBRWN();														 /*得到流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));   /*交易流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));     /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],APPVersion,sizeof(APPVersion)); /*应用程序版本号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ParaFileVersion,sizeof(ParaFileVersion)); /*参数文件版本号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BDataFileVersion,sizeof(BDataFileVersion)); /*业务数据文件版本号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],ChechStatus,sizeof(ChechStatus)); /*自检状态*/
 	Send_Buf[CmdLenght] = 0x03 	;
 	CmdLenght+=0x03;
	 /*发送命令*/
     i = MealComparefunDemo(Command,Send_Buf,CmdLenght);
	  /***************************************************************************/
 	if(i == 0x01)	 //
 	 return 1;
	Lenght = HL_BufferToInit(&rx1Buf[2]);	 //判断数据长度是否
	if(Lenght == 0x00)
	 return  1 ;
	 for(i=0;i<23;i++)
	 {
	   MName[i] = rx1Buf[i+4];//得到商幻
	 }
	 for(i=0;i<3;i++)
	 {
	   BNO[i+3] = rx1Buf[i+27+3];//得到批次号
	 }
	 for(i=0;i<11;i++)
	 {
	   APPVersion[i] = rx1Buf[i+0x21];//得到程序版本号
	 }
	 for(i=0;i<11;i++)
	 {
	   ParaFileVersion[i] = rx1Buf[i+0x2c];//得到参数文件版本
	 }
	 for(i=0;i<11;i++)
	 {
	   BDataFileVersion[i] = rx1Buf[i+0x37];//业务数据版本文件
	 }
	 for(i=0;i<4;i++)
	 {
	   UpdataFlag[i] = rx1Buf[i+0x42];//得到批次号
	 }
	 for(i=0;i<4;i++)
   {
      MenuNo[i]= rx1Buf[i+0x46];
      //printf("%X ",MenuNo[i]);
   }
   if(MenuNo[0]!=0xdd)  return 1; 
	 for(i=0;i<4;i++)
	 {
	   ACK[i] = rx1Buf[i+0x4A];//得到
	 }
	 for(i=0;i<11;i++)
	 {
	   WordKeyCipher[i] = rx1Buf[i+0x4E];//得到工作密文
	 }
   for(i=0;i<11;i++)
	 {
	   MAC[i] = rx1Buf[i+0x59];
	 }
   if(ACK[3]==0x24)
	 {
	   return 1 ;
	 }
   return 0 ;
}

void StructCopyToBuffer(unsigned char *dest)
{
  long j0=0,i=0,k=0;
//上传4份餐品的数据 4*(4+20+2+4+4)
  for(j0 = 0; j0 < 4; j0++)
	{
	  for(i=0;i<4;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealID[i];
		
	  for(i=0;i<20;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealName[i];

