jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
		dest[k++]= Meal[sell_type[j0]-1].MealNum[0]; //第一个数为0
	  dest[k++]= DefineMeal[sell_type[j0]-1].MealCount; //第二个数为餐品的数量

	  for(i=0;i<6;i++) 
	  dest[k++]=Meal[sell_type[j0]-1].MealPrice[i];

	  for(i=0;i<4;i++)
	  dest[k++]=Meal[sell_type[j0]-1].MealType[i];
	}
}

/*******************************************************************************
* Function Name  : 餐品数据对比		 0X0200
* Description    :餐品数据对比
* Input          : void
* Output         : void
* Return         : char
* Time          :2014-4-7  MrLao   数据域采用TVL格式
*******************************************************************************/
unsigned char k = 0 ;
MealCompareDataStruct MealCompareData;
uint32_t  MealDataCompareFun(void)
{
  
 	unsigned char i= 0 ;
  long  Lenght = 0 ,j;
//	unsigned char MealID = 0 ;
	long  CmdLenght = 0 ;
	unsigned char status = 0 ;
	unsigned char Send_Buf[400];
	unsigned char TempBuffer[37*4]={0};
	unsigned char Buffer[36*4]={0};
	mem_set_00(rx1Buf,sizeof(rx1Buf));

	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN(); /*得到水流号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));                   /*交易流水线*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));                     /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));       /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO));   /*终端所在地域编号*/
 	Send_Buf[CmdLenght] =  0xbc ;	 //T  餐品数据对比， 数据域采用TVL格式
	Send_Buf[CmdLenght+1] =  0x00 ;	 //L 数据长度
	Send_Buf[CmdLenght+2] =  36*4 ;	  //V 数据内容  
	CmdLenght += 3;
	StructCopyToBuffer(Buffer);
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Buffer,sizeof(Buffer));

	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;

	/*发送命令*/
  i = MealComparefunDemo(0x0200,Send_Buf,CmdLenght);

/***************************************************************************/
  MealCompareData.MealCompareTotoal= 0; 
    /*单片是否成功*/
	if(i==0x01) //超时
	{		
		return MealCompareData.MealCompareTotoal; 
	}
	
	Lenght = HL_BufferToInit(&rx1Buf[2]);		//得到数据长度
	GetData(&ReturnData.Lenght[0],rx1Buf,Lenght,0xc0);	  /*返回状态*/
	
 	//printf("Status=%x\r\n",ReturnData.Lenght[0]);

	if(ReturnData.Lenght[0] == 0x00 )
	{
		MealCompareData.MealCompareTotoal= 0xFFFFFFFF;	
	    return MealCompareData.MealCompareTotoal;	 /*数据正确*/
	} 
	if(ReturnData.Lenght[0] == 0x24 )
	{
		MealCompareData.MealCompareTotoal= 0xFFFFFFFF;	
	    return MealCompareData.MealCompareTotoal;	 /*数据正确*/
	}
	CmdLenght = GetData(TempBuffer,rx1Buf,Lenght,0xBC);/*餐品对比*/
  //printf("StatusCmdLenght=%x\r\n",CmdLenght);
	if(CmdLenght>37)
	{
	  //status  = CmdLenght / 37  ;
		for(i=0;i<4;i++)
		{
			if(rx1Buf[47+i*37]==0x04)   //餐品对比标志
			{
				MealCompareData.MealComparePart[i]=0xFF;  //144-36/3  108/3=36
			}					
			else
			{
				MealCompareData.MealComparePart[i]=rx1Buf[36+i*37];
		  }				
		}
		return MealCompareData.MealCompareTotoal ;/*餐品对比信息*/
	}
  MealCompareData.MealCompareTotoal=0;
  return MealCompareData.MealCompareTotoal;
}


/*******************************************************************************
* Function Name  : 2.3.3 签退		 0X0300
* Description    :退签函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char SignOutFun()
{

 	unsigned char i = 0 ;
  long  Lenght = 0 ,j;
	long 	CmdLenght = 0 ;
	unsigned char 	  Send_Buf[400];

  mem_set_00(rx1Buf,sizeof(rx1Buf));
  /*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/
	GetBRWN(); /*得到水流号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
  i = MealComparefunDemo(0x0300,Send_Buf,CmdLenght);

	if(i == 0x01)
	return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]);
	 for(j=0;j<Lenght+7;j++)
	 {
//	 printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }
   return 0 ;
}

 /*******************************************************************************
* Function Name  : 状态上传函数		 0X0400
* Description    :状态函数
* Input          : void
* Output         : void
* Return         : void         ok
*******************************************************************************/
unsigned char StatusUploadingFun(uint16_t erro_status)
 {

	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j;
	 long	 CmdLenght = 0 ;
   uint8_t Temperature_t=0;
   uint16_t CoinsTotoal_t=0;
   uint8_t  Temperature_tt[5]={0};
   uint8_t  CoinsTotoal_tt[5]={0};
	 uint8_t	Send_Buf[400]={0};
	 uint8_t  state_temp[2]={0};  
	 //sprintf(state_temp,"%x",erro_status); 
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 /*水流号++*/
	 Send_Buf[0] =	0x02 ;
	 Send_Buf[1] =	0x00 ;
	 Send_Buf[2] =	0x00 ;
	 Send_Buf[3] =	0x00 ;
	 Send_Buf[4] =	0x00 ;
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 GetBRWN(); /*得到水流号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 
   state_temp[1]=(erro_status&0x00ff);
	 state_temp[0]=(erro_status>>8)&0x00ff;
	 for(i=0;i<3;i++) 
	 {
		 DeviceStatus[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceStatus,sizeof(DeviceStatus));  /*终端的状态*/
   Temperature_t= Temperature;
   state_temp[1]=(Temperature_t&0x00ff);
	 state_temp[0]=(Temperature_t>>8)&0x00ff;
   memcpy(Temperature_tt,DeviceTemperature,sizeof(DeviceTemperature));
	 for(i=0;i<3;i++) 
	 {
		 Temperature_tt[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Temperature_tt,sizeof(Temperature_tt));  /*终端的温度*/
   CoinsTotoal_t =CoinsTotoalMessageWriteToFlash.CoinTotoal;
   state_temp[1]=(CoinsTotoal_t&0x00ff);
	 state_temp[0]=(CoinsTotoal_t>>8)&0x00ff;   
   memcpy(CoinsTotoal_tt,DeviceCoinsTotal,sizeof(DeviceCoinsTotal));  
	 for(i=0;i<3;i++) 
	 {
		 CoinsTotoal_tt[3+i]= state_temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],CoinsTotoal_tt,sizeof(CoinsTotoal_tt));  /*终端的硬币数*/   
	 Send_Buf[CmdLenght] = 0x03  ;
	 CmdLenght+=0x03;
	 i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);//0x0400 状态上送
	 if(i == 0x01)
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 for(j=0;j<Lenght+7;j++)
	 {
  
 //   printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);

