jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
	 /*这里赋值餐品的价格*/
	 for(i=0;i<6;i++)
	 MealPrice[3+i] = CustomerSel.MealPrice[i] ;

	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));			/*餐品价格*/
	/*付钱的方式*/
	 PayType[3] = CustomerSel.PayType ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,sizeof(PayType));				/*支付方式*/
	 /*找零金额*/
	 for(i=0;i<6;i++)
	 Change[3+i] = CustomerSel.Change[i] ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change)); 			   /*找零金额*/
	 /*剩余餐品数量*/
	 for(i=0;i<2;i++)
	 {
	  RemainMealNum[3+i] = CustomerSel.RemainMealNum[i] ;
    //printf("CustomerSel.RemainMealNum[i]=%d\r\n",CustomerSel.RemainMealNum[i]);
	 }
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/
   TakeMealFlag[4]= takeout_flag;
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TakeMealFlag,sizeof(TakeMealFlag)); /*取餐标记*/ 
   if(UserActMessageWriteToFlash.UserAct.PayType != '1')
   {     
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosDevNum,PosDevNum[2]+3); /*刷卡器终端号*/
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosTenantNum,PosTenantNum[2]+3); /*刷卡器商户号*/   
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosBatchNum,PosBatchNum[2]+3); /*刷卡器交易流水号*/
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosUserNum,PosUserNum[2]+3); /*用户银行卡号*/
   }
   CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));					  /*MAC*/
	 Send_Buf[CmdLenght] = 0x03  ;  //包含数据包包尾标识和CRC校验码
	 CmdLenght+=0x03;
   i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght); //发送数据(取餐交易)
   mem_copy00(SendBuffer, Send_Buf,CmdLenght);	//把发送的参数传入数组写入SD卡
 /***************************************************************************/
	 HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);	/*保存数据的长度*/

	 if(i == 0x01) /*判断是否超时*/
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 if(Lenght == 0x00)/*判断数据长度*/
	 return 1 ;
	 for(j=0;j<Lenght+7;j++)
	 {
     //printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	 }
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)  //表示正确
	 {
		 if(rx1Buf[7]==0x00)/*是否应答命令*/
		 {
			  return 0 ;
		 }
		 if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		 {
		 //   Batch ++ ;	/*流水号自加*/
			 return 1 ;
		 }
	 }
   return 0 ;
}


 /*******************************************************************************
* Function Name  : SignInFunction
* Description    : 签到函数
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
bool SignInFunction(void)
{
   
  unsigned char i = 50 ;
    do
	{
	  if(SignInFun()==0x00)
	  break;
	  delay_ms(100);
	}while(--i);

	if(i == 0x00)
	  return false;
	else
		return true;
}	
    

/*******************************************************************************
   * 函数名称:StateSend
   * 描    述:状态上送
   *
   * 输    入:无
   * 输    出:无
   * 返    回:void
   * 修改日期:2014年4月4日		ok
   *******************************************************************************/
  uint32_t statesend_record=0;//用来防止多次传输
  void StateSend(void)
  {
	  RTC_TimeShow();//获得时间
	  switch(TimeDate.Minutes)
		{
      case 5:
			case 10:
//			case 12:
//			case 14:
			case 15:						
//	    case 18:
//		  case 19:								
			case 20:
//			case 22:
			case 25:
//			case 26:
//			case 28:
			case 30:
//			case 32:
			case 35:
//			case 36:
//			case 38:
			case 40:
//			case 42:
			case 45:
//			case 46:
//			case 48:				
			case 50:
//			case 52:
			case 55:
//			case 56:
			case 0:				
			{
			  if(TimeDate.Senconds==10) //控制多次传输
			  {
          StatusUploadingFun(0xE800); //状态上送
//          if(statesend_record!=TimeDate.Senconds)
//          {
//             statesend_record= TimeDate.Senconds;
//             StatusUploadingFun(0xE800); //状态上送
//          }  
			  }
			  break;
			}
		  default : break;
		}
  }

  /*******************************************************************************
* Function Name  : SignInFunction
* Description    : 数据回响
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
bool EchoFuntion(void (*fptr)(void))
 {
   unsigned char i = 100 ;
   do
	 {
	   if(EchoFun()==0x00)
	   break;
	   delay_ms(200);
	 }while(--i);
	 if(i == 0x00)
	 return false;
	 (*fptr)() ;
	 return true;

 }
   /*******************************************************************************
* Function Name  :
* Description    : 餐品数据对比
* Input          : void
* Output         : void
* Return         : void
*******************************************************************************/
unsigned char MealDataCompareFunction(void)
 {
   unsigned char i = 100;
   while(i)
   {
    if(MealDataCompareFun()==0x00)
	  return 0 ;
	  --i ;
	  delay_ms(100);
   }
    return 1 ;
 }



   /*******************************************************************************
 * 函数名称:DataUpload
 * 描    述:数据上传
 *
 * 输    入:无
 * 输    出:无
 * 返    回:void
 * 修改日期:2014年4月4日        ok
 *******************************************************************************/
extern uint8_t Current;
void DataUpload(unsigned char takemeal_flag)
{
  uint8_t cnt_t=0;
	itoa(f_name,TimeDate);	  //把时间转换成字符
	if(UserActMessageWriteToFlash.UserAct.MealID==0x00)
	{
		for(cnt_t=0;cnt_t<10;cnt_t++)
		{
	    printf("upload/UserAct.MealID == %d\r\n",UserActMessageWriteToFlash.UserAct.MealID);
			delay_ms(200);
		}
		while(1);
	}
	MealArr(UserActMessageWriteToFlash.UserAct.MealID);
	/*发送取餐数据给服务器*/
  memset(Record_buffer,0,254);
	if(TakeMealsFun(Record_buffer,takemeal_flag) == 0x01) //表示发送失败
	{
    Sd_Write('n',takemeal_flag);//发送失败
	}
	else
  {
		Sd_Write('y',takemeal_flag);//改变当前最后两位为N0
  }
  UserActMessageWriteToFlash.UserAct.MealID= 0x00;//数据上传还一次对ID清零，这样就可以知道数据是否上传了
}	

 /*******************************************************************************
* Function Name  : 取餐发送数据  OK
* Description    : 取餐发送数据
* Input          : void
* Output         : void
* Return         : void
    08 10 00 0f c0 00 01 24 c9 00 08 00 00 00 00 00 00 00 00 03 e8 47
   //应答码 2位          MAC 8位
*******************************************************************************/

CustomerSel__struction CustomerSel;

char ReadBuf[20]={0};
unsigned char TakeMealsFun1(unsigned char *SendBuffer)
 {
	 char temp[10]={0};
	 
