jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
	 unsigned char i = 0 ;
	 long  Lenght = 0 ,j=0;
	 long  CmdLenght = 0 ;
   unsigned char	   Send_Buf[256]={0};	//要发送的数据啦
	 mem_set_00(rx1Buf,sizeof(rx1Buf));
	 SearchSeparator(ReadBuf,SendBuffer,1); //读取包头
	 StringToHexGroup1(temp,ReadBuf,10);	 
	 /*水流号++*/
	 for(i=0;i<5;i++)
	 {
	  Send_Buf[i] =	temp[i] ;
	 }
	 CmdLenght = 5 ;
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));	/*终端的TID*/
	 //GetBRWN();
	 SearchSeparator(ReadBuf,SendBuffer,3); //读取流水号
	 StringToHexGroup1(temp,ReadBuf,14);
	 for(i=0;i<7;i++)
	 {
		 BRWN[3+i]=temp[i];
	 }
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));	/*批次号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
   
	 SearchSeparator(ReadBuf,SendBuffer,7); /*交易金额*/
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 DealBalance[3+i]=temp[i];
	 } 	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DealBalance,sizeof(DealBalance)); /*交易金额(支付金额) */
   
	 SearchSeparator(ReadBuf,SendBuffer,8); //餐品ID
	 StringToHexGroup1(temp,ReadBuf,8); 
   for(i=0;i<4;i++)
   {
		 MealID[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealID,sizeof(MealID)); /*餐品ID*/
   
	 SearchSeparator(ReadBuf,SendBuffer,9); //餐品数量
	 StringToHexGroup1(temp,ReadBuf,2);
 	 MealNO[3]=temp[0];
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealNO,sizeof(MealNO)); /*餐品购买数量*/
   
	 SearchSeparator(ReadBuf,SendBuffer,10); //餐品名字
   for(i=0;i<20;i++)
   {
		 MealName[3+i]=ReadBuf[i];
	 }	
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealName,sizeof(MealName)); /*餐品名字*/
   
	 SearchSeparator(ReadBuf,SendBuffer,11); //餐品价格
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 MealPrice[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));			/*餐品价格*/
   
	 SearchSeparator(ReadBuf,SendBuffer,12); //付款方式
 	 PayType[3]=ReadBuf[0];	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,PayType[2]+3);				/*支付方式*/
   
	 SearchSeparator(ReadBuf,SendBuffer,13); //找零金额
	 StringToHexGroup1(temp,ReadBuf,12); 
   for(i=0;i<6;i++)
   {
		 Change[3+i]=temp[i];
	 }		 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change)); 			   /*找零金额*/
   
	 SearchSeparator(ReadBuf,SendBuffer,14); //剩余餐品数量
	 StringToHexGroup1(temp,ReadBuf,4); 
   for(i=0;i<4;i++)
   {
		 RemainMealNum[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/
   
	 SearchSeparator(ReadBuf,SendBuffer,15); //取餐标记
	 StringToHexGroup1(temp,ReadBuf,4); 	 
   for(i=0;i<2;i++)
   {
		 TakeMealFlag[3+i]=temp[i];
	 }	 
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TakeMealFlag,sizeof(TakeMealFlag));  /*取餐标记*/
   
   if(PayType[3]!= '1')//现金的时候不上传下面数据
   {
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,16); //刷卡器终端号
     PosDevNum[2]= strlen(ReadBuf);
     for(i=0;i<PosDevNum[2];i++)
        PosDevNum[3+i]=ReadBuf[i];  //终端号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosDevNum,PosDevNum[2]+3);	
     
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,17); //刷卡器商号号
     PosTenantNum[2]= strlen(ReadBuf);   
     for(i=0;i<PosTenantNum[2];i++)
        PosTenantNum[3+i]=ReadBuf[i];  //商户号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosTenantNum,PosTenantNum[2]+3);
     
     memset(ReadBuf,0,sizeof(ReadBuf));
     SearchSeparator(ReadBuf,SendBuffer,18); //刷卡器交易流水号    
     PosBatchNum[2]= strlen(ReadBuf); 
     for(i=0;i<PosBatchNum[2];i++)
        PosBatchNum[3+i]=ReadBuf[i];  //流水号
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosBatchNum,PosBatchNum[2]+3);
     
     memset(ReadBuf,0,sizeof(ReadBuf));     
     SearchSeparator(ReadBuf,SendBuffer,19); //用户卡号
     PosUserNum[2]= strlen(ReadBuf);  
     for(i=0;i<PosUserNum[2];i++)
        PosUserNum[3+i]= ReadBuf[i];   //卡号  
     CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PosUserNum,PosUserNum[2]+3);    
   }  
	 CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));					  /*MAC*/	 
	 Send_Buf[CmdLenght] = 0x03  ;  //包含数据包包尾标识和CRC校验码
	 CmdLenght+=0x03;
   i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght); //发送数据(取餐交易)
 /***************************************************************************/
	 HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);	/*保存数据的长度*/

	 if(i == 0x01) /*判断是否超时*/
	 return 1 ;
	 Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	 if(Lenght == 0x00)/*判断数据长度*/
	 return 1 ;
	 if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)  //表示正确
	 {
		 if(rx1Buf[7]==0x00)/*是否应答命令*/
		 {
			return 0 ;
		 }
		 if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		 {
			return 1 ;
		 }
	 }
   return 0 ;
 }

char ReadSdBuff[512]={0};
char SendHostBuff[128]={0};
//void DataUpload(void)
//{
//	//读取SD卡中当天的数据
//	//读取第16个','后面的内容
//	//判断是否为'N',是则发送数据
//	//读取第16个','后面的内容
//  unsigned char DelteFlag = 0 ;//用来标记是否全部上传了数据的函数
//	unsigned char Times  = 0  ;
//	RTC_TimeShow();
//	itoa(f_name,TimeDate);	  //把时间转换成字符

//	  do
//	  {
//	     if(Fread(ReadSdBuff)== 0x00)					      //出错记录，然后跳出显示错误
//		   break ;
//    }while(1);
//	SearchSeparator(ReadBuf,ReadSdBuff,17);
//  if(ReadBuf[0]=='N')
//	{
//		 if(TakeMealsFun1(ReadSdBuff)==0);
//		 //在第十六个逗号后写Y
//		 
////		SearchSeparator(ReadBuf,ReadSdBuff,FH); //读取包头
////		memcpy_02(SendHostBuff,ReadBuf,6);
////		SearchSeparator(SendHostBuff,ReadSdBuff,TID); //读取TID
////		//读取Buffer
////		SendDataToHost();
//	}
//	if(ReadBuf[0]=='Y')
//	{
//				
//	}
//}



 /*******************************************************************************
 * 函数名称:StringToHexGroup1                                                                    
 * 描    述:将字符数组转换为hex数组,功能有所修改                                                                  
 *                                                                               
 * 输    入:                                                                   
 * 输    出:bool                                                                      
 * 返    回:void                                                               
 * 修改日期:2013年8月28日  
 *******************************************************************************/
bool StringToHexGroup1(unsigned char *OutHexBuffer, char *InStrBuffer, unsigned int strLength)
{
  unsigned int i, k=0;
  unsigned char HByte,LByte;
//	if(InStrBuffer[strLength-1]!=0x0A)
//		return false;
  for(i=0; i<strLength; i=i+2)
  {
    if(InStrBuffer[i]>='0' && InStrBuffer[i]<='9')
    {
      HByte=InStrBuffer[i]-'0';
    }
    else if(InStrBuffer[i]>='A' && InStrBuffer[i]<='F')
    {
      HByte=InStrBuffer[i]-'A' +10;
    }
    else
    {
      HByte=InStrBuffer[i];
      return false;
    }
    HByte=HByte <<4;
    HByte = HByte & 0xF0;
    if(InStrBuffer[i+1]>='0' && InStrBuffer[i+1]<='9')
    {
       LByte=InStrBuffer[i+1]-'0';
    }
    else if(InStrBuffer[i+1]>='A' && InStrBuffer[i+1]<='F')
    {
       LByte=InStrBuffer[i+1]-'A' +10;
    }
    else
    {
       LByte=InStrBuffer[i];
       return false;
    }
		OutHexBuffer[k++]=HByte |LByte;		
 }
 return true;
}
